In [2]:
# Importing library
import pandas as pd

In [4]:
# Sample dataset
data = {
    'ID': [1, 2, 3, 4, 5, 6],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Sid', 'Frank'],
    'Age': [20, 30, 40, 50, 23, 65],
    'Country': ['USA', 'UK', 'USA', 'Canada', 'India', 'UK'],
    'Sales': [200, 350, 500, 800, 150, 700 ]
}

In [7]:
df = pd.DataFrame(data)

In [9]:
df.head(6)

   ID     Name  Age Country  Sales
0   1    Alice   20     USA    200
1   2      Bob   30      UK    350
2   3  Charlie   40     USA    500
3   4    David   50  Canada    800
4   5      Sid   23   India    150
5   6    Frank   65      UK    700

In [6]:
# 1. Character Map Transformation - Convert Name column to uppercase
df['Name'] = df['Name'].str.upper()
print("\nCharacter Map Transformation:\n", df)

Character Map Transformation:
    ID     Name  Age Country  Sales
0   1    ALICE   20     USA    200
1   2      BOB   30      UK    350
2   3  CHARLIE   40     USA    500
3   4    DAVID   50  Canada    800
4   5      SID   23   India    150
5   6    FRANK   65      UK    700

In [10]:
# 2. Multicast Transformation - Create copies of dataset
df_copy1 = df.copy()
df_copy2 = df.copy()
print("\nMulticast Transformation - Two copies created")

Multicast Transformation - Two copies created

In [11]:
# 3. Conditional Split Transformation - Filter rows where Sales > 300
df_filtered = df[df['Sales'] > 300]
print("\nConditional Split Transformation:\n", df_filtered)

Conditional Split Transformation:
    ID     Name  Age Country  Sales
1   2      Bob   30      UK    350
2   3  Charlie   40     USA    500
3   4    David   50  Canada    800
5   6    Frank   65      UK    700

In [12]:
# 4. Aggregation Transformation - Total sales per country
df_aggregated = df.groupby('Country')['Sales'].sum().reset_index()
print("\nAggregation Transformation:\n", df_aggregated)

Aggregation Transformation:
   Country  Sales
0  Canada    800
1   India    150
2      UK   1050
3     USA    700

In [16]:
# 5. Sorting Transformation - Sort by Sales in descending order
df_sorted = df.sort_values(by='Sales', ascending=False)
print("\nSorting Transformation:\n", df_sorted)

Sorting Transformation:
    ID     Name  Age Country  Sales Sales Category
3   4    David   50  Canada    800           High
5   6    Frank   65      UK    700           High
2   3  Charlie   40     USA    500           High
1   2      Bob   30      UK    350           High
0   1    Alice   20     USA    200            Low
4   5      Sid   23   India    150            Low

In [17]:
# 6. Derived Column Transformation - Categorize Sales as High or Low
df['Sales Category'] = df['Sales'].apply(lambda x: 'High' if x > 300 else 'Low')
print("\nDerived Column Transformation:\n", df)

Derived Column Transformation:
    ID     Name  Age Country  Sales Sales Category
0   1    Alice   20     USA    200            Low
1   2      Bob   30      UK    350           High
2   3  Charlie   40     USA    500           High
3   4    David   50  Canada    800           High
4   5      Sid   23   India    150            Low
5   6    Frank   65      UK    700           High